<?php

/**
1. Определить сложность следующих алгоритмов:
• - Поиск элемента массива с известным индексом
 * Независимо от количества элеметнов в массиве, понадобится только одно действие обращения к нужному элементу по индексу. Сложность O(1)
• - Дублирование одномерного массива через foreach
 * Нужно будет пройтись по каждому элементу один раз, т.е. сложность O(n)
• - Рекурсивная функция нахождения факториала числа
 * function factorial(n) будет возвращать n*factorial(n-1), и так до 1, т.е. в итоге понадобится n действий. Сложность O(n)
• - Удаление элемента массива с известным индексом
 * Как и в первом случае, нужно только одна итерация. Сложность O(1)
 */